<?php
/*
* 4. Спроектируйте класс для работы со строками, класс должен иметь как публичные
* так и приватные методы, право решение какие методы какими делать стоит за вами, 
* но хорошее правило делать приватными только те методы которые 
* будут использоваться внутри класса.
* Список того что этот класс должен уметь:
*  а) Делать строку в верхний регистр
*  б) Заменять пробелы на + при это строка должна быть в верхнем регистре
*  в) Заменять О на 0 (ноль), I на 1 (один), S на $
*  г) Искать подстроку в строке (функция strstr http://php.net/manual/ru/function.strstr.php )
*  д) Создавать случайную строку из имеющегося набора букв (в нижнем регистре) и 
*     цифр и возвращать ее в верхний регистр
***/

class StringAbuser
{
  
  public function stringToUp()
  {
    
  }
  
  public function spaceToPlus()
  {
    
  }
  
  public function oToZero()
  {
    
  }
  
  public function strStr()
  {
    
  }
  
  public function randomString()
  {
    
  }
}